namespace OneDotLearnWebApp.Helpers
{
    public class TrainingCategoriesHelper
    {
        #region Data Members
        #endregion

        #region Constructors
        public TrainingCategoriesHelper()
        {
            TopTrainingCategories = new()
            {
                (1, "تطوير البرمجيات | Software Development"),
                (2, "تصميم مواقع الويب | Website Design"),
                (3, "تصميم الرسوم | Graphic Design"),
                (4, "إدارة قواعد البيانات | Database Administration"),
                (5, "علم البيانات | Data Science"),
                (6, "الذكاء الاصطناعي | Artificial Intelligence"),
                (7, "إدارة الشبكات | Network Administration"),
                (8, "الحوسبة السحابية | Cloud Computing"),
                (9, "أمن المعلومات | Cybersecurity"),
                (10, "الحوسبة التطبيقية | Applied Computing"),
                (11, "إدارة الأعمال | Business Management"),
            };

            SubTrainingCategories = new()
            {
                (1, "هندسة البرمجيات | Software Engineering"),
                (1, "معمار البرمجيات | Software Architecture"),
                (1, "تطوير تطبيقات سطح المكتب | Desktop Application Development"),
                (1, "تطوير تطبيقات الويب | Web Application Development"),
                (1, "تطوير تطبيقات الهاتف الذكي | Mobile App Development"),
                (1, "تطوير تطبيقات الألعاب | Games Application Development"),
                (4, "إدارة قواعد بيانات أوراكل | Oracle DB Administration"),
                (4, "إدارة قواعد بيانات أوراكل بيركلي | Oracle Berkeley DB Administration"),
                (4, "إدارة قواعد بيانات ميكروسوفت إس كيو إل | Microsoft SQL DB Administration"),
                (4, "إدارة قواعد بيانات ميكروسوفت كوزموس | Microsoft Azure Cosmos DB Administration"),
                (4, "إدارة قواعد بيانات أباتشي كوتش | Apache CouchDB Administration"),
                (4, "إدارة قواعد بيانات أمازون بالوثائق | Amazon DocumentDB Administration"),
                (4, "إدارة قواعد بيانات أمازون دينامو | Amazon DynamoDB Administration"),
                (4, "إدارة قواعد بيانات مونجو | MongoDB Administration"),
                (4, "إدارة قواعد بيانات أباتشي كاسندرا | Apache Cassandra Administration"),
                (4, "إدارة قواعد البيانات أباتشي إتش بيز | Apache HBase Administration"),
                (4, "إدارة قواعد بيانات رديس | Redis DB Administration"),
                (6, "معالجة اللغة الطبيعية | Natural Language Processing"),
                (6, "تمثيل المعرفة | Knowledge Representation"),
                (6, "الاستدلال الآلي | Automatic Reasoning"),
                (6, "تعلم الآلة | Machine Learning"),
                (6, "التعلم العميق | Deep Learning"),
                (6, "الذكاء الاصطناعي الإنتاجي | Generative AI"),
                (6, "إبصار الحاسوب | Computer Vision"),
                (6, "علم الروبوت | Robotics"),
                (7, "أسس إدارة الشبكات | Fundamentals of Network Administration"),
                (7, "موجهات سيكسو | Cisco Routers"),
                (7, "نظام التشغيل لينكس | Linux Operating System"),
                (7, "نظام التشغيل خادم ويندوز | Windows Server 2022 Operatiog System"),
                (7, "نظام التشغيل يونيكس | Unix Operating System"),
                (8, "خدمات أمازون للويب | Amazon Web Services (AWS)"),
                (8, "ميكروسوفت آزور | Microsoft Azure"),
                (8, "منصة جوجل السحابية | Google Cloud Platform"),
                (9, "التصميم بمساعدة الحاسوب | Computer Aided Design (CAD)"),
                (9, "الرياضيات بمساعدة الحاسوب | Computer Aided Mathematics"),
                (9, "تخطيط موارد المؤسسات | Enterprise Resource Planning (ERP)"),
                (9, "المحاسبة باستخدام الحاسوب | Accounting Using Computers"),
                (9, "الإحصاء باستخدام الحاسوب | Statistics Using Computers"),
                (9, "الدعم الفني للحاسوب | Computer Technical Support"),
            };
        }
        #endregion

        #region Properties
        public List<(int Id, string Title)> TopTrainingCategories { get; set; }
        public List<(int Id, string Title)> SubTrainingCategories { get; set; }
        #endregion

        #region Methods
        #endregion
    }
}

/*
#region Data Members
#endregion

#region Constructors
#endregion

#region Properties
#endregion

#region Methods
#endregion
*/

/*
 تطوير البرمجيات -- تطبيقات سطح المكتب
 تطوير البرمجيات -- تطبيقات الويب
 تطوير البرمجيات -- تطبيقات الهاتف الذكي
 تطوير البرمجيات -- تطبيقات الألعاب
 تصميم مواقع الويب
 تصميم الرسوم
 إدارة قواعد البيانات -- قواعد البيانات العلائقية -- قواعد بيانات أوراكل
 إدارة قواعد البيانات -- قواعد البيانات العلائقية -- قواعد بيانات ميكروسوفت إس كيو إل
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن الوثائق -- قواعد بيانات أباتشي كوتش
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن الوثائق -- قواعد بيانات أمازون
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن الوثائق -- قواعد بيانات ميكروسوفت كوزموس
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن الوثائق -- قواعد بيانات مونجو
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن الوثائق -- قواعد بيانات كوتش
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- المخزن العمودي -- أباتشي كاسندرا
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- المخزن العمودي -- أباتشي إتش بيز
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن المفتاح/القيمة -- أمازون دينامو
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن المفتاح/القيمة -- رديس
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن المفتاح/القيمة -- أوراكل بيركلي
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن المفتاح/القيمة -- أمازون دينامو
 إدارة قواعد البيانات -- قواعد البيانات غير العلائقية -- مخزن البيانان الترابطي
 علم البيانات
 الذكاء الاصطناعي -- معالجة اللغة الطبيعية
 الذكاء الاصطناعي -- تمثيل المعرفة
 الذكاء الاصطناعي -- الاستدلال الآلي
 الذكاء الاصطناعي -- تعلم الآلة
 الذكاء الاصطناعي -- بصر الحاسوب
 الذكاء الاصطناعي -- علم الروبوت
 إدارة الشبكات -- موجهات سيكسو
 إدارة الشبكات -- خادم لينكس
 إدارة الشبكات -- خادم ويندوز
 إدارة الشبكات -- يونيكس
 الحوسبة السحابية -- خدمات أمازون للويب (إيه دبليو إس)
 الحوسبة السحابية -- ميكروسوفت آزور
 الحوسبة السحابية -- منصة جوجل السحابية)
 أمن المعلومات
 الحوسبة التطبيقية -- التصميم بمساعدة الحاسوب
 الحوسبة التطبيقية -- الرياضيات بمساعدة الحاسوب
 الحوسبة التطبيقية -- تخطيط موارد المؤسسات
 الحوسبة التطبيقية -- المحاسبة باستخدام الحاسوب
 الحوسبة التطبيقية -- الإحصاء باستخدام الحاسوب
 الحوسبة التطبيقية -- الدعم الفني للحاسوب
 إدارة الأعمال
*/





/*
 تطوير تطبيقات سطح المكتب
 تطوير تطبيقات الويب
 تطوير تطبيقات الهاتف الذكي
 تطوير تطبيقات الألعاب
 تصميم مواقع الويب
 تصميم الرسوم
 إدارة قواعد بيانات أوراكل
 إدارة قواعد بيانات ميكروسوفت إس كيو إل
 إدارة قواعد بيانات أباتشي كوتش
 إدارة قواعد بيانات أمازون
 إدارة قواعد بيانات ميكروسوفت كوزموس
 إدارة قواعد بيانات مونجو
 إدارة قواعد بيانات كوتش
 إدارة قواعد بيانات أباتشي كاسندرا
 إدارة قواعد البيانات أباتشي إتش بيز
 إدارة قواعد بيانات أمازون دينامو
 إدارة قواعد بيانات رديس
 إدارة قواعد بيانات أوراكل بيركلي
 إدارة قواعد البيانات أمازون دينامو
  علم البيانات
 الذكاء الاصطناعي -- معالجة اللغة الطبيعية
 الذكاء الاصطناعي -- تمثيل المعرفة
 الذكاء الاصطناعي -- الاستدلال الآلي
 الذكاء الاصطناعي -- تعلم الآلة
 الذكاء الاصطناعي -- بصر الحاسوب
 الذكاء الاصطناعي -- علم الروبوت
 إدارة الشبكات -- موجهات سيكسو
 إدارة الشبكات -- نظام التشغيل خادم لينكس
 إدارة الشبكات -- نظام التشغيل خادم ويندوز
 إدارة الشبكات -- نظام التشغيل يونيكس
 الحوسبة السحابية -- خدمات أمازون للويب (إيه دبليو إس)
 الحوسبة السحابية -- ميكروسوفت آزور
 الحوسبة السحابية -- منصة جوجل السحابية)
 أمن المعلومات
 الحوسبة التطبيقية -- التصميم بمساعدة الحاسوب
 الحوسبة التطبيقية -- الرياضيات بمساعدة الحاسوب
 الحوسبة التطبيقية -- تخطيط موارد المؤسسات
 الحوسبة التطبيقية -- المحاسبة باستخدام الحاسوب
 الحوسبة التطبيقية -- الإحصاء باستخدام الحاسوب
 الحوسبة التطبيقية -- الدعم الفني للحاسوب
 إدارة الأعمال
*/